In [1]:
import pandas as pd

In [15]:
data = pd.read_csv('JEOPARDY_CSV.csv')

In [16]:
data.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,The city of Yuma in this state has a record av...,Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [17]:
data.columns

Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')

In [18]:
data.columns = ['show_id', 'date', 'round', 'category', 'value', 'question', 'answer']

In [20]:
data = data[data.value != 'None']

In [21]:
data['value'] = data['value'].apply(lambda x: int(x[1:].replace(',',''))) #remove $ remove comma and convert to int

In [24]:
data['year'] = data['date'].apply(lambda x: int(x[:4]))

In [30]:
min(data['year']), max(data['year'])

(1984, 2012)

In [33]:
data.head()

,show_id,date,round,category,value,question,answer,year
0,4680,2004-12-31,Jeopardy!,HISTORY,200,"For the last 8 years of his life, Galileo was ...",Copernicus,2004
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,2004
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,200,The city of Yuma in this state has a record av...,Arizona,2004
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's,2004
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,200,"Signer of the Dec. of Indep., framer of the Co...",John Adams,2004

In [32]:
data['round'].unique()

array(['Jeopardy!', 'Double Jeopardy!'], dtype=object)

In [35]:
len(data['category'].unique())

26951

In [36]:
data['value'].unique()

array([  200,   400,   600,   800,  2000,  1000,  1200,  1600,  3200,
        5000,   100,   300,   500,  1500,  4800,  1800,  1100,  2200,
        3400,  3000,  4000,  6800,  1900,  3100,   700,  1400,  2800,
        8000,  6000,  2400, 12000,  3800,  2500,  6200, 10000,  7000,
        1492,  7400,  1300,  7200,  2600,  3300,  5400,  4500,  2100,
         900,  3600,  2127,   367,  4400,  3500,  2900,  3900,  4100,
        4600, 10800,  2300,  5600,  1111,  8200,  5800,   750,  7500,
        1700,  9000,  6100,  1020,  4700,  2021,  5200,  3389,  4200,
           5,  2001,  1263,  4637,  3201,  6600,  3700,  2990,  5500,
       14000,  2700,  6400,   350,  8600,  6300,   250,  3989,  8917,
        9500,  1246,  6435,  8800,  2222,  2746, 10400,  7600,  6700,
        5100, 13200,  4300,  1407, 12400,  5401,  7800,  1183,  1203,
       13000, 11600, 14200,  1809,  8400,  8700, 11000,  5201,  1801,
        3499,  5700,   601,  4008,    50,  2344,  2811, 18000,  1777,
        3599,  9800,   796,  3150,    20,  1810,    22,  9200,  1512,
        8500,   585,  1534, 13800,  5001,  4238, 16400,  1347,  2547,
       11200])